# Operações no Pandas

In [2]:
import pandas as pd

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4], 
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
#analisa coluna e retorna o tipo de dados que é a coluna do dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [11]:
#verifica tamanho das colunas
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

## valores unicos do dataframe

In [12]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [14]:
#quantos valores unicos existem
df["col2"].nunique()

3

In [18]:
#contagem de cada um dos elementos unicos 
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## funções

In [21]:
def comp (x):
    return x ** 2 + 3

In [24]:
df["col1"].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [25]:
#como eu posso adicionar uma nova coluna para esse resultado do apply?
df["col1_cal"] = df["col1"].apply(comp)

In [26]:
df

   col1  col2 col3  col1_cal
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [28]:
#substituindo a função def por lambda
df["col1"].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

## operações

In [32]:
#soma
df["col1"].sum()

10

In [33]:
#media
df["col1"].mean()

2.5

In [35]:
#multiplica - sequência
df["col1"].product()

24

In [36]:
#desvio padrão
df["col1"].std()

1.2909944487358056

In [37]:
#max
df["col1"].max()

4

In [39]:
#min
df["col1"].min()

1

In [41]:
#indice com valor maximo
df["col1"].idxmax()

3

In [42]:
df

   col1  col2 col3  col1_cal
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [45]:
#combinações, ex: somatoria da coluna sempre 1 sempre que o valor da coluna 2 for igual a 444
df[df["col2"] == 444]

   col1  col2 col3  col1_cal
0     1   444  abc         4
3     4   444  xyz        19

In [46]:
df[df["col2"] == 444]["col1"].sum()

5

In [49]:
#ordenar
df.sort_values(by="col2")

   col1  col2 col3  col1_cal
0     1   444  abc         4
3     4   444  xyz        19
1     2   555  def         7
2     3   666  ghi        12